20-(auth)orization/purrr/app/views/cats/show.html.erb


  <% @cat.endorsements.each do |endorsement| %>
---
SELECT "endorsements".* FROM "endorsements" WHERE "endorsements"."cat_id" = ?  [["cat_id", 1]]