20-(auth)orization/purrr/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def logged_in_user
    @current_user = User.find_by(id: session[:user_id])