20-(auth)orization/purrr/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(user_name: params[:session][:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "dwire"], ["LIMIT", 1]]