20-(auth)orization/purrr/app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("name", "user_name", "age", "cats_owned", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "John"], ["user_name", "new user"], ["age", 30], ["cats_owned", 1000], ["created_at", "2020-11-09 20:52:14.336008"], ["updated_at", "2020-11-09 20:52:14.336008"]]