13-rails-CRUD-continued/purrr/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "softness", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Form"], ["softness", "low"], ["age", 2], ["created_at", "2020-10-29 15:58:51.450167"], ["updated_at", "2020-10-29 15:58:51.450167"]]
---
  def create
    cat = Cat.create(cat_params)

UPDATE "cats" SET "softness" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["softness", "High"], ["updated_at", "2020-10-29 15:58:36.987037"], ["id", 4]]
---
  def update
    # @cat = Cat.find(params[:id])
    @cat.update(cat_params)

DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 5]]
---
  def destroy
    # @cat = Cat.find(params[:id])
    @cat.destroy

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def find_cat
    @cat = Cat.find(params[:id])