15-rails-validations/purrr/app/views/cats/show.html.erb

SELECT "endorsements".* FROM "endorsements" WHERE "endorsements"."cat_id" = ?  [["cat_id", 14]]
---

<% @cat.endorsements.each do |endorsement| %>