19-(auth)entication-bcrypt/purrr/app/views/cats/show.html.erb

SELECT "endorsements".* FROM "endorsements" WHERE "endorsements"."cat_id" = ?  [["cat_id", 13]]
---

  <% @cat.endorsements.each do |endorsement| %>