19-(auth)entication-bcrypt/purrr/app/controllers/application_controller.rb

  def logged_in_user
    @current_user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]