15-rails-validations/purrr/app/views/endorsements/new.html.erb

  <%= f.label :user_id %>
  <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"

  <%= f.label :cat_id %>
  <%= f.collection_select :cat_id, Cat.all, :id, :name %>
---
SELECT "cats".* FROM "cats"