16-camping-is-fun/app/views/signups/new.html.erb

SELECT "campers".* FROM "campers"
---
  <%= f.label :camper %>
  <%= f.collection_select :camper_id, Camper.all, :id, :name, prompt: true %>

SELECT "activities".* FROM "activities"
---
  <%= f.label :activity %>
  <%= f.collection_select :activity_id, Activity.all, :id, :name, prompt: true %>