19-(auth)entication-bcrypt/purrr/app/views/users/show.html.erb

SELECT COUNT(*) FROM "cats" INNER JOIN "endorsements" ON "cats"."id" = "endorsements"."cat_id" WHERE "endorsements"."user_id" = ?  [["user_id", 22]]
---
<p><b>Cats Owned:</b> <%= @user.cats_owned %></p>
<p>Written <%= @user.cats.count %> endorsments</p>