12-rails-CU/purrr/app/controllers/cats_controller.rb

  def create
    strong_params = params.require(:cat).permit(:name, :age, :softness)
                    # {name: "Wade", age: 6, softnes: "High"} permitted: true
    cat = Cat.create(strong_params)
---
INSERT INTO "cats" ("name", "softness", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "last"], ["softness", "low"], ["age", 3], ["created_at", "2020-10-28 20:23:20.443851"], ["updated_at", "2020-10-28 20:23:20.443851"]]