16-camping-is-fun/app/views/campers/show.html.erb


<% @camper.activities.each do |activity| %>
---
SELECT "activities".* FROM "activities" INNER JOIN "signups" ON "activities"."id" = "signups"."activity_id" WHERE "signups"."camper_id" = ?  [["camper_id", 20]]