16-camping-is-fun/app/controllers/campers_controller.rb

SELECT "campers".* FROM "campers"
---
  def index
    @campers = Camper.all

INSERT INTO "campers" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "George"], ["age", 10], ["created_at", "2020-11-03 19:45:10.008568"], ["updated_at", "2020-11-03 19:45:10.008568"]]
---
  def create
    camper = Camper.new(camper_params)

    if camper.save

SELECT "campers".* FROM "campers" WHERE "campers"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
  def show
    @camper = Camper.find(params[:id])