16-camping-is-fun/app/controllers/signups_controller.rb

  def create
    signup = Signup.create!(signup_params)
---
INSERT INTO "signups" ("camper_id", "activity_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["camper_id", 20], ["activity_id", 20], ["time", 6], ["created_at", "2020-11-03 19:32:37.414835"], ["updated_at", "2020-11-03 19:32:37.414835"]]