14-rails-associations/purrr/app/controllers/endorsements_controller.rb

  def create
    endorsement = Endorsement.create(endorsement_params)
---
INSERT INTO "endorsements" ("cat_id", "user_id", "content", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cat_id", 14], ["user_id", 22], ["content", "Drinks milk like no other"], ["rating", 1], ["created_at", "2020-10-29 20:18:59.409601"], ["updated_at", "2020-10-29 20:18:59.409601"]]