20-(auth)orization/purrr/app/views/endorsements/new.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :user_id %>
      <%= f.collection_select :user_id, User.all, :id, :name %>

SELECT "cats".* FROM "cats"
---
      <%= f.label :cat_id %>
      <%= f.collection_select :cat_id, Cat.all, :id, :name %>